## Plan Result (prod_enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to add, 0 to change, 15 to destroy.</code></pre>

* Replace
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_storage_account.sa




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group_member.dts_operation_members must be replaced
-/+ resource "azuread_group_member" "dts_operation_members" {
      ~ group_object_id  = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab" -> "000f31d7-c041-4afe-8a2f-b1c8e9e6032d" # forces replacement
      ~ id               = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab/member/2070d748-c35c-478f-a5ca-ec8a5c4ff10d" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group_member.members["Contributor-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "b01634eb-45c1-40c6-8550-0d1b019a9a7e/member/af66f4e5-bd36-4ad9-a265-d9e7c947cbab" -> (known after apply)
      ~ member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab" -> "000f31d7-c041-4afe-8a2f-b1c8e9e6032d" # forces replacement
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azuread_group_member.members["Key Vault Administrator-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "459d4d36-2c15-464e-be9f-33398348d2ea/member/af66f4e5-bd36-4ad9-a265-d9e7c947cbab" -> (known after apply)
      ~ member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab" -> "000f31d7-c041-4afe-8a2f-b1c8e9e6032d" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "cd61f617-1cfa-458d-820f-9f674f091f3a"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - object_id               = "fd709296-724b-4cf9-b3bb-733de9eceb8a"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Backup",
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "Recover",
                  - "Restore",
                  - "SetIssuers",
                  - "Update",
                ]
              - key_permissions         = [
                  - "Backup",
                  - "Create",
                  - "Decrypt",
                  - "Delete",
                  - "Encrypt",
                  - "Get",
                  - "Import",
                  - "List",
                  - "Recover",
                  - "Restore",
                  - "Sign",
                  - "UnwrapKey",
                  - "Update",
                  - "Verify",
                  - "WrapKey",
                ]
              - object_id               = "b01634eb-45c1-40c6-8550-0d1b019a9a7e"
              - secret_permissions      = [
                  - "Get",
                  - "Set",
                  - "List",
                  - "Delete",
                  - "Restore",
                  - "Recover",
                  - "Backup",
                ]
              - storage_permissions     = [
                  - "Backup",
                  - "Delete",
                  - "DeleteSAS",
                  - "Get",
                  - "GetSAS",
                  - "List",
                  - "ListSAS",
                  - "Recover",
                  - "RegenerateKey",
                  - "Restore",
                  - "Set",
                  - "SetSAS",
                  - "Update",
                ]
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "dad693c4-36ad-468f-94e9-76faa4bc844b"
              - secret_permissions      = [
                  - "Get",
                  - "Set",
                  - "List",
                  - "Delete",
                  - "Restore",
                  - "Recover",
                  - "Backup",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "0ec60e03-4262-44ce-abcf-83e2131c9207"
              - secret_permissions      = [
                  - "Get",
                  - "Set",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "46f87b41-2951-4c0e-95c0-f6b8bcafd024"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv" -> (known after apply)
        name                            = "c1497c3d7b51d03189ee3kv"
      ~ resource_group_name             = "azure-control-sbox-rg" -> "azure-control-ptlsbox-rg" # forces replacement
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ vault_uri                       = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/" -> (known after apply)
        # (6 unchanged attributes hidden)

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault_access_policy.permissions must be replaced
-/+ resource "azurerm_key_vault_access_policy" "permissions" {
      ~ id                      = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/objectId/b01634eb-45c1-40c6-8550-0d1b019a9a7e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv" # forces replacement -> (known after apply)
        # (6 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault_secret.aks_admin_group_id must be replaced
-/+ resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      ~ id                      = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/aks-admin-rbac-group-id/d8371fefb3d64249a78cf07349dab83d" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv" # forces replacement -> (known after apply)
        name                    = "aks-admin-rbac-group-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/aks-admin-rbac-group-id/versions/d8371fefb3d64249a78cf07349dab83d" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/aks-admin-rbac-group-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "d8371fefb3d64249a78cf07349dab83d" -> (known after apply)
      ~ versionless_id          = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/aks-admin-rbac-group-id" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault_secret.aks_user_group_id must be replaced
-/+ resource "azurerm_key_vault_secret" "aks_user_group_id" {
      ~ id                      = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/aks-user-rbac-group-id/c6221b7ba0c74cb2a1ed93949a044ca6" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv" # forces replacement -> (known after apply)
        name                    = "aks-user-rbac-group-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/aks-user-rbac-group-id/versions/c6221b7ba0c74cb2a1ed93949a044ca6" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/aks-user-rbac-group-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "c6221b7ba0c74cb2a1ed93949a044ca6" -> (known after apply)
      ~ versionless_id          = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/aks-user-rbac-group-id" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault_secret.sp_app_id must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_app_id" {
      ~ id                      = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/sp-application-id/21fd29f5c0ab4b9eabeb7fc3fce71db2" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv" # forces replacement -> (known after apply)
        name                    = "sp-application-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/sp-application-id/versions/21fd29f5c0ab4b9eabeb7fc3fce71db2" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/sp-application-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "21fd29f5c0ab4b9eabeb7fc3fce71db2" -> (known after apply)
      ~ versionless_id          = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/sp-application-id" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault_secret.sp_object_id must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_object_id" {
      ~ id                      = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/sp-object-id/e0383d31b4fb4f44bf7c8932eed9ddfc" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv" # forces replacement -> (known after apply)
        name                    = "sp-object-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/sp-object-id/versions/e0383d31b4fb4f44bf7c8932eed9ddfc" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/sp-object-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "e0383d31b4fb4f44bf7c8932eed9ddfc" -> (known after apply)
      ~ versionless_id          = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/sp-object-id" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_key_vault_secret.sp_token must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_token" {
      ~ id                      = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/sp-token/8ec2fab38b55457892df9fe7781d8226" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv" # forces replacement -> (known after apply)
        name                    = "sp-token"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/sp-token/versions/8ec2fab38b55457892df9fe7781d8226" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/secrets/sp-token" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "8ec2fab38b55457892df9fe7781d8226" -> (known after apply)
      ~ versionless_id          = "https://c1497c3d7b51d03189ee3kv.vault.azure.net/secrets/sp-token" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv/providers/Microsoft.Authorization/roleAssignments/174973a9-63ac-c9a3-5f01-5c32caaf481e" -> (known after apply)
      ~ name                             = "174973a9-63ac-c9a3-5f01-5c32caaf481e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/f25e0fa2-a7c8-4377-a976-54943a77a395" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c1497c3d7b51d03189ee3kv" # forces replacement -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c1497c3d7b51d03189ee3sa/providers/Microsoft.Authorization/roleAssignments/56f62777-f91b-f2af-e213-12cdcedacf7c" -> (known after apply)
      ~ name                             = "56f62777-f91b-f2af-e213-12cdcedacf7c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c1497c3d7b51d03189ee3sa" # forces replacement -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c1497c3d7b51d03189ee3sa/providers/Microsoft.Authorization/roleAssignments/0d141d04-b194-b929-ad99-998e7a72e4da" -> (known after apply)
      ~ name                             = "0d141d04-b194-b929-ad99-998e7a72e4da" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c1497c3d7b51d03189ee3sa" # forces replacement -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Authorization/roleAssignments/469d15df-37a8-04a5-a5e5-b58f7a0eb84b" -> (known after apply)
      ~ name                             = "469d15df-37a8-04a5-a5e5-b58f7a0eb84b" -> (known after apply)
      ~ principal_id                     = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab" -> "000f31d7-c041-4afe-8a2f-b1c8e9e6032d" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_storage_account.sa must be replaced
-/+ resource "azurerm_storage_account" "sa" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/c1497c3d7b51d03189ee3sa" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
        name                              = "c1497c3d7b51d03189ee3sa"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://c1497c3d7b51d03189ee3sa.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "c1497c3d7b51d03189ee3sa.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://c1497c3d7b51d03189ee3sa.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "c1497c3d7b51d03189ee3sa.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://c1497c3d7b51d03189ee3sa.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "c1497c3d7b51d03189ee3sa.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://c1497c3d7b51d03189ee3sa.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "c1497c3d7b51d03189ee3sa.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://c1497c3d7b51d03189ee3sa.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "c1497c3d7b51d03189ee3sa.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://c1497c3d7b51d03189ee3sa.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "c1497c3d7b51d03189ee3sa.z33.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "azure-control-sbox-rg" -> "azure-control-ptlsbox-rg" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (16 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null

          - delete_retention_policy {
              - days = 7 -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      - timeouts {}
    }

Plan: 15 to add, 0 to change, 15 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":85,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise","Vars":{}} -->